conf1/src/Catalogs/ВариантыПороговУстановкиТарифовНаХабы/ВариантыПороговУстановкиТарифовНаХабы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВариантыПороговУстановкиТарифовНаХабы</name>
  <tabularSections>
    <name>Пороги</name>
    <attributes>
      <name>НижняяГраница</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Тариф</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

conf1/src/Catalogs/ВариантыПороговУстановкиТарифовНаХабы/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

// Получает таблицу порогов варианта тарифа
//
// Параметры:
//  ВариантПорога  - СправочникСсылка.ВариантыПороговУстановкиТарифовНаХабы - Тариф
//
// Возвращаемое значение:
//  ТаблицаЗначений   - Пороги тарифа (ВерхняяГраница (Число(15, 0)), Тариф (Число(15, 2)))
//
Функция ПолучитьПорогиВариантаТарифа(ВариантПорога)Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПорогиУстановкиТарифовНаХабыПороги.НижняяГраница КАК НижняяГраница,
	|	ПорогиУстановкиТарифовНаХабыПороги.Тариф КАК Тариф
	|ИЗ
	|	Справочник.ВариантыПороговУстановкиТарифовНаХабы.Пороги КАК ПорогиУстановкиТарифовНаХабыПороги
	|ГДЕ
	|	ПорогиУстановкиТарифовНаХабыПороги.Ссылка = &ВариантПорога
	|
	|УПОРЯДОЧИТЬ ПО
	|	НижняяГраница УБЫВ
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("ВариантПорога", ВариантПорога);
	
	Результат = Запрос.Выполнить();
	Возврат Результат.Выгрузить();
КонецФункции // ПолучитьПорогиТарифа()


// Получает значение тарифа по среднедневному обороту
//
// Параметры:
//  ВариантПорога  - СправочникСсылка.ВариантыПороговУстановкиТарифовНаХабы - Тариф
//  СреднедневнойОборот  - Число - Значение среднедневного оборота
//
// Возвращаемое значение:
//  Число   - значение тарифа
//
Функция ПолучитьЗначениеТарифаПоСреднедневномуОбороту(ВариантПорога, СреднедневнойОборот)Экспорт
	
	ПорогиТарифа = ПолучитьПорогиВариантаТарифа(ВариантПорога);
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПорогиТарифа.НижняяГраница КАК НижняяГраница,
	|	ПорогиТарифа.Тариф КАК Тариф
	|ПОМЕСТИТЬ втПороги
	|ИЗ
	|	&ПорогиТарифа КАК ПорогиТарифа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втПороги.НижняяГраница КАК НижняяГраница,
	|	втПороги.Тариф КАК Тариф
	|ИЗ
	|	втПороги КАК втПороги
	|ГДЕ
	|	втПороги.НижняяГраница <= &СреднедневнойОборот";
	
	Запрос.УстановитьПараметр("ПорогиТарифа", ПорогиТарифа);
	Запрос.УстановитьПараметр("СреднедневнойОборот", СреднедневнойОборот);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда 
		
		Возврат Выборка.Тариф;
	КонецЕсли;	
	Возврат 0;
КонецФункции // ПолучитьПорогиТарифа()

#КонецОбласти
